package org.chudnovskiy0;

/**
 * Потрібно розробити додаток, в якому користувач може зареєструватися.
 * При реєстрації потрібно валідувати username.
 * Вимоги до цього поля:
 *  не повинно бути порожнім,
 *  не повинно містити нічого окрім літер,
 *  повинно бути унікальним
 * Для реалізації цього завдання необхідно зробити клас UserNameValidator в якому реалізувати логіку валідації
 * Для перевірки окремих умов створити окремі класи (EmptyStringValidator, ProhibitSymbolValidator, UniqueNameValidator).
 * В кожному класі буде вага, на основі якої і оберається в якій послідовності буде застосований тій чи інший валідатор.
 * Валідатори всі потрібно зберігти в TreeSet, що забезпечить впорядкований за вагою порядок застосування валідатора.
 *
 * Привести приклад застосування валідатора при реєстрації користувача (достатньо ввести з консолі username)
 */
public class App {
}
